Repository: yglsan2/Noublipo
Catalog: lib/l10n/app_*.arb
Languages: fr

# searchHint
source: Search in list
fr: Rechercher dans la liste

source: Add item
fr: Ajouter un article

source: Add to which store?
fr: Ajouter à quel magasin ?

source: Other store
fr: Autre magasin

source: Manage stores
fr: Gérer les magasins

# manageStoresSubtitle
source: Add, rename or delete a store
fr: Ajouter, renommer ou supprimer un magasin

# renameStore
source: Rename
fr: Renommer

source: Delete store
fr: Supprimer le magasin

# storeDeletedSnackbar
source: Store deleted
fr: Magasin supprimé

# storeNameOrUnset
source: Unnamed
fr: Sans nom

# manageStoresHint
source: Tap a store to rename it, or delete it to remove it from the list.
fr: Touchez un magasin pour le renommer, ou supprimez-le pour le retirer de la liste.

# tapToSetStoreName
source: Tap to set a name
fr: Touchez pour définir un nom

source: Empty list
fr: Liste vide

# tapToAdd
source: Tap here or + to add an item
fr: Appuyez ici ou sur + pour ajouter un article

source: Settings
fr: Paramètres

# languageLabel
source: Language
fr: Langue

# languageSystem
source: System
fr: Système

source: Share
fr: Partager

source: More
fr: Plus

# catalogAndInspiration
source: Catalog & inspiration
fr: Catalogue & inspiration

# planningRecurrentSeasonal
source: Planning (recurring & seasonal)
fr: Planification (récurrents & saisonniers)

source: Scan barcode
fr: Scanner un code-barres

# quickAddListArticles
source: Quick add (list + items)
fr: Ajout rapide (liste + articles)

source: Select items
fr: Sélectionner des articles

source: Remove checked
fr: Supprimer les cochés

source: New list
fr: Nouvelle liste

source: Duplicate list
fr: Dupliquer la liste

source: Save as template
fr: Enregistrer comme modèle

# newFromTemplate
source: New list from template
fr: Nouvelle liste depuis modèle

# stats
source: Statistics
fr: Statistiques

source: List duplicated
fr: Liste dupliquée

source: Quick add
fr: Ajout rapide

# noMatchForSearch
source: No item matches "{query}"
fr: Aucun article ne correspond à « {query} »

source: Clear
fr: Effacer

source: No results
fr: Aucun résultat

# clearSearchToSeeAll
source: Clear search to see all items
fr: Effacez la recherche pour voir tous les articles

# touchToCheck
source: Tap to check
fr: Touchez pour cocher

source: To buy
fr: À acheter

source: Item removed
fr: Article supprimé

source: Cancel
fr: Annuler

source: Delete
fr: Supprimer

# modify
source: Edit
fr: Modifier

# deleteArticleConfirm
source: Delete this item?
fr: Supprimer l'article ?

source: Share list
fr: Partager la liste

source: Export as text
fr: Exporter en texte

source: About
fr: À propos

source: Backup & restore
fr: Sauvegarde et restauration

# backupExportImport
source: Export or import lists and settings
fr: Exporter ou importer listes et paramètres

# backupScreenTitle
source: Backup and restore
fr: Sauvegarde et restauration

# backupExportTitle
source: Export backup
fr: Exporter une sauvegarde

# backupImportTitle
source: Import backup
fr: Importer une sauvegarde

# backupExportSubtitle
source: Generates a JSON file to share or store
fr: Génère un fichier JSON à partager ou à stocker

# backupImportSubtitle
source: Replace current data with the chosen file
fr: Remplacer les données actuelles par le fichier choisi

# backupIntro
source: Export all your lists, settings and planning to a file, or restore from a backup.
fr: Exportez toutes vos listes, paramètres et planification dans un fichier, ou restaurez à partir d'une sauvegarde.

# backupExportSuccess
source: Backup exported. Share or save the file.
fr: Sauvegarde exportée. Partagez ou enregistrez le fichier.

# backupImportConfirm
source: Current lists and settings will be replaced by the file content. Continue?
fr: Les listes et paramètres actuels seront remplacés par le contenu du fichier. Continuer ?

# backupImportSuccess
source: Backup restored.
fr: Sauvegarde restaurée.

# scanPlaceBarcode
source: Place the barcode in the frame
fr: Placez le code-barres dans le cadre

# scanProductAdded
source: {name} added to list
fr: {name} ajouté à la liste

# scanClose
source: Close
fr: Fermer

# sharedListCount
source: Shared • {count}
fr: Partagée • {count}

# sharedList
source: Shared
fr: Partagée

source: List deleted
fr: Liste supprimée

# tooltipClear
source: Clear
fr: Effacer

# tooltipSyncDone
source: Synced
fr: Synchronisé

# tooltipSyncUpload
source: Sync on all devices
fr: Synchroniser sur tous les appareils

# tooltipMoveTo
source: Move to
fr: Déplacer vers

source: Items moved
fr: Articles déplacés

# colorChipTapToSet
source: {name} – tap to set
fr: {name} – touchez pour définir

source: Delete group
fr: Supprimer le groupe

# deleteListConfirm
source: Delete this list?
fr: Supprimer la liste ?

# sendListByMessage
source: Send list by message or email
fr: Envoyer la liste par message ou email

source: Copy list
fr: Copier la liste

# copyListSubtitle
source: Copy to clipboard (read-only)
fr: Copier dans le presse-papier (lecture seule)

# shareRealtime
source: Share in real time
fr: Partager en temps réel

# shareRealtimeWithOthers
source: With others (same list, live)
fr: Avec d'autres personnes (même liste à jour)

# signInGoogleToEnable
source: Sign in with Google to enable
fr: Connectez-vous avec Google pour activer

# listEmptySnackbar
source: Empty list
fr: Liste vide

source: List copied to clipboard
fr: Liste copiée dans le presse-papier

source: Copy link
fr: Copier le lien

source: Share link
fr: Partager le lien

source: New shared list
fr: Nouvelle liste partagée

# newSharedListConfirm
source: You will leave the current list and create a new shared list from your personal list.
fr: Vous quitterez la liste actuelle et créerez une nouvelle liste partagée à partir de votre liste personnelle.

source: Create
fr: Créer

# createNewSharedList
source: Create a new shared list
fr: Créer une nouvelle liste partagée

source: Create share link
fr: Créer un lien de partage

# joinList
source: Join a list
fr: Rejoindre une liste

source: Link created
fr: Lien créé

# sendLinkToOthers
source: Send the link or code so others can view and edit the list in real time.
fr: Envoyez le lien ou le code pour que d'autres puissent voir et modifier la liste en temps réel.

source: Short code
fr: Code court

# errorPrefix
source: Error
fr: Erreur

source: Link copied
fr: Lien copié

source: Join
fr: Rejoindre

source: List joined
fr: Liste rejointe

source: Checked items removed
fr: Articles cochés supprimés

# itemWillBeRemovedFromList
source: "{name}" will be removed from the list.
fr: « {name} » sera supprimé de la liste.

source: Copy code
fr: Copier le code

# copyCodeLabel
source: Copy code: {code}
fr: Copier le code : {code}

# backToPersonalList
source: Back to your personal list
fr: Retour à votre liste personnelle

source: Leave shared list
fr: Quitter la liste partagée

# leftListSnackbar
source: Disconnected. List kept locally.
fr: Déconnecté. Liste conservée en local.

source: Disconnect
fr: Déconnexion

# signInGoogleSameAccount
source: Sign in with the same Google account on each device to share the list in real time.
fr: Connectez-vous avec le même compte Google sur chaque appareil pour partager la liste en temps réel.

source: Sync enabled
fr: Synchronisation activée

source: Sign in with Google
fr: Se connecter avec Google

# selectedCount
source: {n} selected
fr: {n} sélectionné(s)

source: Items deleted
fr: Articles supprimés

source: Future purchases
fr: Achats futurs

# listLabel
source: List
fr: Liste

# groupsLabel
source: Groups
fr: Groupes

# articleStyle
source: Item style
fr: Style des articles

# styleBar
source: Bar
fr: Bande

# styleFilled
source: Classic rectangle
fr: Rectangle classique

# styleSuperRound
source: Pill
fr: Pilule

# styleLiquid
source: Liquid
fr: Goutte

# styleBulle
source: Bubbles
fr: Bulles

# styleZebra
source: Zebra
fr: Zébrure

source: Dark mode
fr: Mode nuit

# darkModeSubtitle
source: Dark theme, easy on the eyes
fr: Thème sombre reposant pour les yeux

# capitalizeNames
source: Capitalize item names
fr: Capitaliser les noms des articles

# capitalizeSubtitle
source: First letter uppercase
fr: Première lettre en majuscule

source: Reminders per item
fr: Rappels par article

# remindersSubtitle
source: Optional: alarm and note per item (hidden if disabled)
fr: Optionnel : alarme et note par article (caché si désactivé)

# categoriesLabel
source: Categories (store, type…)
fr: Catégories (magasin, type…)

# formLabel
source: Form
fr: Formulaire

# legendLabel
source: Stores
fr: Magasins

# categoriesHint
source: Form: optional name when adding. Stores: squares at top, tap a square to add or set a store (e.g. Carrefour).
fr: Formulaire : nom optionnel à l'ajout. Magasins : carrés en haut, touchez un carré pour ajouter ou définir un magasin (enseigne, marché, supermarché…).

# categoryDefinedByStoresBar
source: Set by the stores bar at top
fr: Définie par les magasins en haut

# tapSquareToSetStoreHint
source: Tap a square at top to set the store or category.
fr: Touchez un carré en haut pour définir le magasin ou la catégorie.

# categoryLabel
source: Category
fr: Catégorie

# sortListLabel
source: List sort (Noublipo+)
fr: Tri de la liste (Noublipo+)

# sortOrder
source: Order
fr: Ordre

# sortName
source: Name
fr: Nom

# sortColor
source: Color
fr: Couleur

# showPrices
source: Show prices and total
fr: Afficher les prix et le total

# showPricesSubtitle
source: Price per item and estimated total
fr: Prix par article et total estimé

# aboutSubtitle
source: User guide, author, GPL v3 licence, GDPR
fr: Mode d'emploi, créateur, licence GPL v3, RGPD

# saveAsTemplateTitle
source: Save as template
fr: Enregistrer comme modèle

# modelNameHint
source: Template name
fr: Nom du modèle

# modelSaved
source: Template saved
fr: Modèle enregistré

source: Save
fr: Enregistrer

# noTemplates
source: No templates. Save a list as template (⋮ menu).
fr: Aucun modèle. Enregistrez une liste comme modèle (menu ⋮).

# chooseTemplate
source: Choose a template
fr: Choisir un modèle

# templateItemCount
source: {count} item(s)
fr: {count} article(s)

# listCreatedFromTemplate
source: List "{name}" created
fr: Liste « {name} » créée

# newListTitle
source: New list
fr: Nouvelle liste

# listNameHint
source: List name
fr: Nom de la liste

# createButton
source: Create
fr: Créer

# renameTitle
source: Rename
fr: Renommer

# groupLabel
source: Group
fr: Groupe

source: No group
fr: Sans groupe

# newGroupTitle
source: New group
fr: Nouveau groupe

# groupNameHint
source: E.g. Shopping, DIY
fr: Ex: Courses, Brico

# listGroupsTitle
source: List groups
fr: Groupes de listes

# newButton
source: New
fr: Nouveau

# noGroupsHint
source: No groups. Create one to organize your lists (e.g. Shopping, DIY).
fr: Aucun groupe. Créez-en un pour organiser vos listes (ex: Courses, Brico).

source: Group deleted
fr: Groupe supprimé

# renameGroupTitle
source: Rename group
fr: Renommer le groupe

# renameListTitle
source: Rename list
fr: Renommer la liste

# nameHint
source: Name
fr: Nom

# saveButton
source: Save
fr: Enregistrer

# chooseGroup
source: Choose a group
fr: Choisir un groupe

source: Name for this color
fr: Nom pour cette couleur

# colorNameHint
source: E.g. Carrefour, Fruit, Urgent. Items in this color will show this name.
fr: Ex : Carrefour, Fruits, Urgent… Les articles de cette couleur afficheront ce nom.

# categoryNameHint
source: Store or category name
fr: Nom du magasin ou de la catégorie

# shareJoinMessage
source: Join my real-time shopping list: {link}
fr: Rejoignez ma liste de courses en temps réel : {link}

# shareSubject
source: List {appName}
fr: Liste {appName}

# joinListHint
source: Paste the link, 8-character code or ID to join the shared list.
fr: Collez le lien, le code à 8 caractères ou l'ID pour rejoindre la liste partagée.

# linkCodeHint
source: Link, code (e.g. ABC12XYZ) or ID
fr: Lien, code (ex. ABC12XYZ) ou ID

source: Import
fr: Importer

# backupFileNotAccessible
source: File not accessible (e.g. Web).
fr: Fichier non accessible (ex. Web).

# backupImportError
source: Import error: {error}
fr: Erreur lors de l'import : {error}

# scanAvailablePlus
source: Available in Noublipo+
fr: Disponible en Noublipo+

# everyoneSeesSameList
source: Everyone sees the same list and changes in real time.
fr: Tout le monde voit la même liste et les modifications en direct.

# everyoneSeesSameListWithCount
source: {count} participant(s) • Everyone sees the same list live.
fr: {count} participant(s) • Tout le monde voit la même liste en direct.

# voiceUnavailable
source: Voice input not available
fr: Saisie vocale non disponible

# voiceError
source: Voice input unavailable
fr: Saisie vocale indisponible

# colorLabel
source: Color
fr: Couleur

# addToListItem
source: Add to list
fr: Ajouter à la liste

# quickAddHint
source: Enter at least one item (e.g. Apple or List Store : Apple)
fr: Indiquez au moins un article (ex: Pomme ou Liste Auchan : Pomme)

# linkCopiedBrowser
source: Link copied: paste it in your browser.
fr: Lien copié : collez-le dans votre navigateur.

# signInToJoinList
source: Sign in with Google to join the list.
fr: Connectez-vous avec Google pour rejoindre la liste.

# cannotJoinList
source: Cannot join: {error}
fr: Impossible de rejoindre : {error}

# autocompleteLabel
source: Auto-completion
fr: Complétion automatique

# autocompleteSubtitle
source: Suggest items from the lexicon as you type (e.g. pu… → purée, pull)
fr: Proposer des articles du lexique en tapant (ex. pu… → purée, pull)

# addForLater
source: For later
fr: Pour plus tard

# addForLaterSnackbar
source: « {name} » added to list (pending)
fr: « {name} » ajouté à la liste (en attente)
